Semester-7/Технология разработки прикладных решений 1С/lab0/src/Documents/ВозвратВелосипедов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ВозвратВелосипедов</Name>
			<BasedOn>
				<xr:Item>Document.ВыдачаВелосипедов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВелосипедыВПрокате</xr:Item>
				<xr:Item>AccumulationRegister.Выручка</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выдача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыдачаВелосипедов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Велосипед</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Велосипеды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВозврата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостояниеВелосипеда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Часы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Semester-7/Технология разработки прикладных решений 1С/lab0/src/AccumulationRegisters/ВелосипедыВПрокате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>ВелосипедыВПрокате</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Велосипед</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Велосипеды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Semester-7/Технология разработки прикладных решений 1С/lab0/src/AccumulationRegisters/Выручка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Выручка</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МоделиВелосипедов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Semester-7/Технология разработки прикладных решений 1С/lab0/src/Enums/СостояниеВелосипеда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СостояниеВелосипеда</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Целый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Испорчен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Semester-7/Технология разработки прикладных решений 1С/lab0/src/Documents/ВозвратВелосипедов/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	// Ввод на основании выдачи: переносим клиента и список велосипедов.
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыдачаВелосипедов") Тогда
		Выдача = ДанныеЗаполнения;
		Клиент = ДанныеЗаполнения.Клиент;
		Состав.Очистить();
		Для Каждого СтрокаВыдачи Из ДанныеЗаполнения.Состав Цикл
			НоваяСтрока = Состав.Добавить();
			НоваяСтрока.Велосипед = СтрокаВыдачи.Велосипед;
			НоваяСтрока.ВремяВыдачи = СтрокаВыдачи.ВремяВыдачи;
			НоваяСтрока.ВремяВозврата = ТекущаяДата();
			НоваяСтрока.Состояние = Перечисления.СостояниеВелосипеда.Целый;
		КонецЦикла;
		РассчитатьСтоимость();
	КонецЕсли;

КонецПроцедуры

Процедура РассчитатьСтоимость() Экспорт

	// Время проката округляем вверх до часа: неполный час считается полным.
	Для Каждого Строка Из Состав Цикл
		Если НЕ ЗначениеЗаполнено(Строка.ВремяВыдачи) ИЛИ НЕ ЗначениеЗаполнено(Строка.ВремяВозврата) Тогда
			Продолжить;
		КонецЕсли;
		Секунды = Строка.ВремяВозврата - Строка.ВремяВыдачи;
		Если Секунды < 0 Тогда
			Секунды = 0;
		КонецЕсли;
		Часы = Цел(Секунды / 3600);
		Если Секунды % 3600 > 0 Тогда
			Часы = Часы + 1;
		КонецЕсли;
		Строка.Часы = Часы;
		Строка.Сумма = Часы * Строка.Велосипед.Модель.ЦенаЗаЧас;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	РассчитатьСтоимость();

	Движения.ВелосипедыВПрокате.Записывать = Истина;
	Движения.Выручка.Записывать = Истина;

	Для Каждого ТекСтрокаСостав Из Состав Цикл

		Движение = Движения.ВелосипедыВПрокате.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Велосипед = ТекСтрокаСостав.Велосипед;
		Движение.Клиент = Клиент;
		Движение.Количество = 1;

		Оборот = Движения.Выручка.Добавить();
		Оборот.Период = Дата;
		Оборот.Модель = ТекСтрокаСостав.Велосипед.Модель;
		Оборот.Клиент = Клиент;
		Оборот.Часы = ТекСтрокаСостав.Часы;
		Оборот.Сумма = ТекСтрокаСостав.Сумма;

		// Испорченный велосипед выводим из оборота — признак снимается вручную
		// после ремонта, в карточке велосипеда.
		Если ТекСтрокаСостав.Состояние = Перечисления.СостояниеВелосипеда.Испорчен Тогда
			ОбъектВелосипеда = ТекСтрокаСостав.Велосипед.ПолучитьОбъект();
			ОбъектВелосипеда.Исправен = Ложь;
			ОбъектВелосипеда.Записать();
			Сообщить("Велосипед " + ТекСтрокаСостав.Велосипед + " помечен как испорченный.");
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры
